# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ProjectLocationSet..::..ReverseIterator Method
ProjectLocationSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ProjectLocationSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As ProjectLocationSetIterator
```

Visual C++
---
```text
public:
virtual ProjectLocationSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
ProjectLocationSet Class
Autodesk.Revit.DB Namespace